app/views/questions/final.html.erb

SELECT "guests".* FROM "guests" ORDER BY club_id count desc
SELECT COUNT(*) FROM "guests" WHERE "guests"."club_id" = ?  [["club_id", 1]]
---
<tbody>
<td><%= club.name %></td><td><%= club.guests.count %></td>