app/controllers/questions_controller.rb

def index
@clubs = Club.all
@guest = Guest.create
---
SELECT "clubs".* FROM "clubs"
INSERT INTO "guests" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 28 Jul 2013 14:46:03 UTC +00:00], ["updated_at", Sun, 28 Jul 2013 14:46:03 UTC +00:00]]

def start
@club = Club.find(params[:club_id])
@guest = current_guest
@guest.club_id = @club.id
@guest.save
@club.votes = @club.guests.count
---
SELECT "clubs".* FROM "clubs" WHERE "clubs"."id" = ? LIMIT 1  [["id", "11"]]
INSERT INTO "guests" ("club_id", "created_at", "updated_at") VALUES (?, ?, ?)  [["club_id", 11], ["created_at", Fri, 26 Jul 2013 14:23:59 UTC +00:00], ["updated_at", Fri, 26 Jul 2013 14:23:59 UTC +00:00]]
UPDATE "clubs" SET "votes" = ?, "updated_at" = ? WHERE "clubs"."id" = 11  [["votes", 4], ["updated_at", Sun, 28 Jul 2013 16:39:18 UTC +00:00]]
UPDATE "guests" SET "club_id" = ?, "updated_at" = ? WHERE "guests"."id" = 34  [["club_id", 8], ["updated_at", Sun, 28 Jul 2013 14:54:59 UTC +00:00]]
SELECT COUNT(*) FROM "guests" WHERE "guests"."club_id" = ?  [["club_id", 1]]

def final
  @guest = Guest.find(params[:id])

  @goalkeeper = Player.find(@guest.goalkeeper)
  @defender1 = Player.find(@guest.defender1)
  @defender2 = Player.find(@guest.defender2)
  @defender3 = Player.find(@guest.defender3)
  @defender4 = Player.find(@guest.defender4)
  @midfielder1 = Player.find(@guest.midfielder1)
  @midfielder2 = Player.find(@guest.midfielder2)
  @midfielder3 = Player.find(@guest.midfielder3)
  @midfielder4 = Player.find(@guest.midfielder4)
  @forward1 = Player.find(@guest.forward1)
  @forward2 = Player.find(@guest.forward2)
  @all_players = Player.all.order('votes desc')
  @final_clubs = Club.all.order('votes asc')
---
SELECT "guests".* FROM "guests" WHERE "guests"."id" = 33 LIMIT 1
SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", 25]]
SELECT "clubs".* FROM "clubs" ORDER BY votes desc