app/controllers/would_you_rather_controller.rb

        @guest.save
    end
    @answer = Answer.create(:player_id => @player.id)
    @player.votes = @player.answers.count
---
SELECT COUNT(*) FROM "answers" WHERE "answers"."player_id" = ?  [["player_id", 26]]