app/controllers/would_you_rather_controller.rb

SELECT "players".* FROM "players" WHERE "players"."position" = 'Goalkeeper'
---
  def show
  	@guest = current_guest
  	@goalies = Player.where(position: 'Goalkeeper').sample(3)

SELECT "players".* FROM "players" WHERE "players"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "guests" SET "midfielder4" = ?, "updated_at" = ? WHERE "guests"."id" = 32  [["midfielder4", 47], ["updated_at", Sat, 27 Jul 2013 20:56:41 UTC +00:00]]
UPDATE "players" SET "votes" = ?, "updated_at" = ? WHERE "players"."id" = 2  [["votes", 5], ["updated_at", Sun, 28 Jul 2013 16:14:45 UTC +00:00]]
INSERT INTO "answers" ("created_at", "player_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 26 Jul 2013 15:16:12 UTC +00:00], ["player_id", 77], ["updated_at", Fri, 26 Jul 2013 15:16:12 UTC +00:00]]
SELECT "players".* FROM "players" WHERE "players"."position" = 'Defender'
---
 def update
 	@player = Player.find(params[:id])
 	@guest = current_guest
 	case step
    when :goalkeeper
    	@guest.goalkeeper = @player.id
    	@guest.save
    	@answer = Answer.create(:player_id => @player.id)
    end
 	case step
    when :defender1
    	@defenders = Player.where(position: 'Defender').sample(3)